Revit 2027 API
ExternalServices.BuiltInExternalServices.IFCConfigurationUpgradeService Property
 The service which performs IFC configuration upgrades during document open.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId IFCConfigurationUpgradeService { get; }
Public Shared ReadOnly Property IFCConfigurationUpgradeService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ IFCConfigurationUpgradeService {
	ExternalServiceId^ get ();
}
static member IFCConfigurationUpgradeService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace